public/musichronicle.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-08 Mon 17:51 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Musichronicle</title>
<meta name="author" content="Aziz Ben Ali" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/stylesheets/main.css">
<link rel="icon" type="image/x-icon" href="/images/favicon.ico">
<meta name="description" content="grtcdr's personal website, containing everything from his blog and résumé, to the scripts and configurations that power his system.">
</head>
<body>
<div id="preamble" class="status">
<ul class="navigation">
  <li><a href="/index.html">Home</a></li>
  <li><a href="/contact.html">Contact</a></li>
  <li><a href="/data/resume.pdf">Résumé</a></li>
</ul>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Musichronicle</h1>
</header><p>
My intentions with this small project is to document the music that
I've recently come to adore, and to share these beautiful sounds with
the rest of you!
</p>

<p>
I usually have trouble recalling the music I'm fond of, and the
artists that express with sounds, what I couldn't with words. I hope
this project succeeds at keeping track of these very artists, and I
look forward to continuously updating this page as time goes on.
</p>

<div id="outline-container-orgd481f7b" class="outline-2">
<h2 id="orgd481f7b">2022</h2>
<div class="outline-text-2" id="text-orgd481f7b">
</div>
<div id="outline-container-org6c890de" class="outline-3">
<h3 id="org6c890de">Son Lux - Tomorrows&#xa0;&#xa0;&#xa0;<span class="tag"><span class="experimental">experimental</span></span></h3>
<div class="outline-text-3" id="text-org6c890de">
<p>
I was recently reintroduced to <a href="https://musicbrainz.org/artist/afcd292c-3c1e-4708-af4a-991aadf957e4">Son Lux</a>, a band of three extremely
talented individuals, by a couple of relatives who went to see their
concert. Although I didn't attend, I'm glad to have been reminded of
Son Lux &#x2013; it had been four whole years since I last listened to their
works.
</p>

<p>
This album is no different, every single track is <i>simply terrific</i>.
</p>

<p>
The element that makes Son Lux stand out the most in this particular
genre, is the distinctiveness of their sound, which can be considered
as having been meticulously engineered to serve the purpose of
exposing you to something you never imagined could exist, all the
while conforming to a rather sophisticated musical structure.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
